<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"e758da65c2cf3f96d519f54cf738209f3d913ff2545fb530ada7b48cfbc69f15","plan_job_ref":"Job Terraform checks on pull request #30 at https://github.com/sudoblark/sudoblark.monsternames.api/actions/runs/12162595921","plan_out_hash":"ba7dbb6a857e78d6a278cde3483c83aca8063547b70ef89606db5acacf114777","plan_hash":"bf93dba4c019d92954cbf50cf63d39e48e1084a07f026cea8131b30490dd205c","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __./infrastructure/sudoblark__
<details>
<summary>Plan: 2 to add, 4 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.api_gateway.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.api_gateway.data.aws_lambda_function.known_lambdas["backend-lambda"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_function" "known_lambdas" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       code_sha256                    = (known after apply)
+       code_signing_config_arn        = (known after apply)
+       dead_letter_config             = (known after apply)
+       description                    = (known after apply)
+       environment                    = (known after apply)
+       ephemeral_storage              = (known after apply)
+       file_system_config             = (known after apply)
+       function_name                  = "aws-prod-monsternames-api-backend-lambda"
+       handler                        = (known after apply)
+       id                             = (known after apply)
+       image_uri                      = (known after apply)
+       invoke_arn                     = (known after apply)
+       kms_key_arn                    = (known after apply)
+       last_modified                  = (known after apply)
+       layers                         = (known after apply)
+       logging_config                 = (known after apply)
+       memory_size                    = (known after apply)
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = (known after apply)
+       role                           = (known after apply)
+       runtime                        = (known after apply)
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags                           = (known after apply)
+       timeout                        = (known after apply)
+       tracing_config                 = (known after apply)
+       version                        = (known after apply)
+       vpc_config                     = (known after apply)
    }

  # module.api_gateway.data.aws_region.current_region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current_region" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.additional_s3_files.module.s3_files.aws_s3_object.uploaded_files["config"] will be updated in-place
!~  resource "aws_s3_object" "uploaded_files" {
!~      content                = <<-EOT
            <!-- HTML for static distribution bundle build -->
            <!DOCTYPE html>
            <html lang="en">
              <head>
                <meta charset="UTF-8">
                <title>Swagger UI</title>
                <link rel="stylesheet" type="text/css" href="https://unpkg.com/swagger-ui-dist@3/swagger-ui.css" >
                <style>
                  html
                  {
                    box-sizing: border-box;
                    overflow: -moz-scrollbars-vertical;
                    overflow-y: scroll;
                  }
            
                  *,
                  *:before,
                  *:after
                  {
                    box-sizing: inherit;
                  }
            
                  body
                  {
                    margin:0;
                    background: #fafafa;
                  }
                  .errors-wrapper {
                     display: none !IMPORTANT;
            	  }
                </style>
              </head>
            
              <body>
                <div id="swagger-ui"></div>
            
                <script src="https://unpkg.com/swagger-ui-dist@3/swagger-ui-bundle.js"> </script>
                <script src="https://unpkg.com/swagger-ui-dist@3/swagger-ui-standalone-preset.js"> </script>    <script>
                window.onload = function() {
            
                  // Begin Swagger UI call region
                  const ui = SwaggerUIBundle({
                    "dom_id": "#swagger-ui",
                    deepLinking: true,
                    presets: [
                      SwaggerUIBundle.presets.apis,
                      SwaggerUIStandalonePreset
                    ],
                    plugins: [
                      SwaggerUIBundle.plugins.DownloadUrl
                    ],
                    layout: "StandaloneLayout",
                    validatorUrl: "https://validator.swagger.io/validator",
                    urls: [
          -           {url: "https://raw.githubusercontent.com/sudoblark/sudoblark.monsternames.api/refs/heads/bugfix/incorrect-auth/application/open_api_definitions/monsternames.yaml", name: "monsternames"}
          +           {url: "https://raw.githubusercontent.com/sudoblark/sudoblark.monsternames.api/refs/heads/main/application/open_api_definitions/monsternames.yaml", name: "monsternames"}
            
                    ],
                    defaultModelsExpandDepth: -1,
                    "urls.primaryName": "monsternames"
                  })
            
            
            
                  window.ui = ui
                }
              </script>
              </body>
            </html>
        EOT
!~      etag                   = "7fe1458e9cfc392efa8fdabdb7cae970" -> "7252813b8329cb78ef8c43ca4705fc21"
        id                     = "swagger_ui/index.html"
        tags                   = {}
!~      version_id             = "********************************" -> (known after apply)
#        (11 unchanged attributes hidden)
    }

  # module.api_gateway.module.restapi_gateway.aws_api_gateway_deployment.deployments["backend"] must be replaced
+/- resource "aws_api_gateway_deployment" "deployments" {
!~      created_date  = "2024-12-04T15:06:40Z" -> (known after apply)
!~      execution_arn = "arn:aws:execute-api:eu-west-2:741139166799:dgo3yzs9ed/" -> (known after apply)
!~      id            = "******" -> (known after apply)
!~      invoke_url    = "https://dgo3yzs9ed.execute-api.eu-west-2.amazonaws.com/" -> (known after apply)
!~      triggers      = { # forces replacement
-           "redeployment" = "0c0f027b55cf81d8cac70e956b94a70cdc57a40e"
        } -> (known after apply) # forces replacement
#        (1 unchanged attribute hidden)
    }

  # module.api_gateway.module.restapi_gateway.aws_api_gateway_rest_api.api_gateway["backend"] will be updated in-place
!~  resource "aws_api_gateway_rest_api" "api_gateway" {
!~      body                         = <<-EOT
            # Copyright (c) 2023, Sudoblark Ltd
            #
            # All rights reserved.
            #
            # This source code is licensed under the BSD 3 clause license found in the
            # LICENSE file in the root directory of this source tree.
            
            openapi: 3.0.1
            info:
              title: Monsternames - OpenAPI 3.0
              description: |-
                This is a relatively simple RESTAPI, based on the OpenAPI 3.0 specification, which generates pseudo-random names for
                common fantasy monsters.
              license:
                name: BSD 3 clause
                url: https://raw.githubusercontent.com/sudoblark/sudoblark.monsternames.api/refs/heads/main/LICENSE.txt
              version: 1.1.0
            externalDocs:
              description: Source Code
              url: https://github.com/sudoblark/sudoblark.monsternames.api
            servers:
              - url: https://monsternames.sudoblark.com
            tags:
              - name: goatmen
                description: Names themed on cute fluffy animals
              - name: goblin
                description: Names themed on washed out wrestlers/average blokes
              - name: ogre
                description: Names themed on cavemen like speech
              - name: orc
                description: Names themed on {noun} + {silly moniker}
              - name: skeleton
                description: Names themed on 18th Century British Gentlemen
              - name: troll
                description: Names themed on a Scandinavian twist
            paths:
              /:
                get:
                  summary: Show Swagger UI
                  x-amazon-apigateway-integration:
                    httpMethod: "GET"
                    uri: "arn:aws:apigateway:eu-west-2:s3:path//prod-monsternames-api-assets/swagger_ui/index.html"
                    credentials: "arn:aws:iam::741139166799:role/aws-prod-monsternames-api-api-gateway-role"
                    type: "aws"
                    passthroughBehavior : "when_no_match"
                    responses:
                      "default": {
                        "statusCode": "200",
                        "responseParameters": {
                          "method.response.header.Content-Type": "'text/html'"
                        }
                      }
                  responses:
                    "200":
                      description: "Successful request"
                      content:
                        text/html:
                          schema:
                            type: string
                      headers:
                        "Content-Type":
                          $ref: '#/components/headers/Content-Type'
            
              /goatmen:
                post:
                  summary: Add pseudo-random name options
                  security:
                    - api_key: []
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  tags:
                    - goatmen
                  requestBody:
                    description: Add first name
                    required: true
                    content:
                      application/json:
                        schema:
                          $ref: "#/components/schemas/FirstNameModel"
                        examples:
                          first_name:
                            $ref: "#/components/examples/FirstName"
            
                  responses:
                    "200":
                      $ref: "#/components/responses/200PostFirstName"
                    "400":
                      $ref: "#/components/responses/400PostInvalidBody"
                    "409":
                      $ref: "#/components/responses/409PostAlreadyExists"
            
                get:
                  summary: Retrieve a pseudo-random name
                  tags:
                    - goatmen
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  responses:
                    "200":
                      $ref: "#/components/responses/200GetFirstName"
            
              /goblin:
                post:
                  summary: Add pseudo-random name options
                  security:
                    - api_key: []
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  tags:
                    - goblin
                  requestBody:
                    description: Add first and/or last name
                    required: true
                    content:
                      application/json:
                        schema:
                          anyOf:
                            - $ref: "#/components/schemas/FirstNameModel"
                            - $ref: "#/components/schemas/LastNameModel"
                            - $ref: "#/components/schemas/FirstAndLastNameModel"
                        examples:
                          first_name:
                            $ref: "#/components/examples/FirstName"
                          last_name:
                            $ref: "#/components/examples/LastName"
                          first_and_last_name:
                            $ref: "#/components/examples/FirstAndLastName"
            
                  responses:
                    "200":
                      $ref: "#/components/responses/200PostFirstAndLastName"
                    "400":
                      $ref: "#/components/responses/400PostInvalidBody"
                    "409":
                      $ref: "#/components/responses/409PostAlreadyExists"
            
                get:
                  summary: Retrieve a pseudo-random name
                  tags:
                    - goblin
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  responses:
                    "200":
                      $ref: "#/components/responses/200GetFirstAndLastName"
            
              /ogre:
                post:
                  summary: Add pseudo-random name options
                  security:
                    - api_key: []
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  tags:
                    - ogre
                  requestBody:
                    description: Add first name
                    required: true
                    content:
                      application/json:
                        schema:
                          $ref: "#/components/schemas/FirstNameModel"
                        examples:
                          first_name:
                            $ref: "#/components/examples/FirstName"
                  responses:
                    "200":
                      $ref: "#/components/responses/200PostFirstName"
                    "400":
                      $ref: "#/components/responses/400PostInvalidBody"
                    "409":
                      $ref: "#/components/responses/409PostAlreadyExists"
            
                get:
                  summary: Retrieve a pseudo-random name
                  tags:
                    - ogre
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  responses:
                    "200":
                      $ref: "#/components/responses/200GetFirstName"
            
              /orc:
                post:
                  summary: Add pseudo-random name options
                  security:
                    - api_key: []
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  tags:
                    - orc
                  requestBody:
                    description: Add first and/or last name
                    required: true
                    content:
                      application/json:
                        schema:
                          anyOf:
                            - $ref: "#/components/schemas/FirstNameModel"
                            - $ref: "#/components/schemas/LastNameModel"
                            - $ref: "#/components/schemas/FirstAndLastNameModel"
                        examples:
                          first_name:
                            $ref: "#/components/examples/FirstName"
                          last_name:
                            $ref: "#/components/examples/LastName"
                          first_and_last_name:
                            $ref: "#/components/examples/FirstAndLastName"
                  responses:
                    "200":
                      $ref: "#/components/responses/200PostFirstAndLastName"
                    "400":
                      $ref: "#/components/responses/400PostInvalidBody"
                    "409":
                      $ref: "#/components/responses/409PostAlreadyExists"
            
                get:
                  summary: Retrieve a pseudo-random name
                  tags:
                    - orc
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  responses:
                    "200":
                      $ref: "#/components/responses/200GetFirstAndLastName"
            
              /skeleton:
                post:
                  summary: Add pseudo-random name options
                  security:
                    - api_key: []
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  tags:
                    - skeleton
                  requestBody:
                    description: Add first and/or last name
                    required: true
                    content:
                      application/json:
                        schema:
                          anyOf:
                            - $ref: "#/components/schemas/FirstNameModel"
                            - $ref: "#/components/schemas/LastNameModel"
                            - $ref: "#/components/schemas/FirstAndLastNameModel"
                        examples:
                          first_name:
                            $ref: "#/components/examples/FirstName"
                          last_name:
                            $ref: "#/components/examples/LastName"
                          first_and_last_name:
                            $ref: "#/components/examples/FirstAndLastName"
                  responses:
                    "200":
                      $ref: "#/components/responses/200PostFirstAndLastName"
                    "400":
                      $ref: "#/components/responses/400PostInvalidBody"
                    "409":
                      $ref: "#/components/responses/409PostAlreadyExists"
            
                get:
                  summary: Retrieve a pseudo-random name
                  tags:
                    - skeleton
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  responses:
                    "200":
                      $ref: "#/components/responses/200GetFirstAndLastName"
            
              /troll:
                post:
                  summary: Add pseudo-random name options
                  security:
                    - api_key: []
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  tags:
                    - troll
                  requestBody:
                    description: Add first and/or last name
                    required: true
                    content:
                      application/json:
                        schema:
                          anyOf:
                            - $ref: "#/components/schemas/FirstNameModel"
                            - $ref: "#/components/schemas/LastNameModel"
                            - $ref: "#/components/schemas/FirstAndLastNameModel"
                        examples:
                          first_name:
                            $ref: "#/components/examples/FirstName"
                          last_name:
                            $ref: "#/components/examples/LastName"
                          first_and_last_name:
                            $ref: "#/components/examples/FirstAndLastName"
                  responses:
                    "200":
                      $ref: "#/components/responses/200PostFirstAndLastName"
                    "400":
                      $ref: "#/components/responses/400PostInvalidBody"
                    "409":
                      $ref: "#/components/responses/409PostAlreadyExists"
                get:
                  summary: Retrieve a pseudo-random name
                  tags:
                    - troll
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  responses:
                    "200":
                      $ref: "#/components/responses/200GetFirstAndLastName"
            
            components:
              headers:
                Content-Type:
                  schema:
                    type: string
                    description: Type of content to return
            
              securitySchemes:
                api_key:
                  type: "apiKey"
                  name: "x-api-key"
                  in: "header"
            
              examples:
                FirstName:
                  summary: Add a new first name
                  value:
                    first_name: Barnaby
                LastName:
                  summary: Add a new last name
                  value:
                    last_name: The brass dragon
                FirstAndLastName:
                  summary: Add a new first and last name
                  value:
                    first_name: Barnaby
                    last_name: The brass dragon
              schemas:
                ErrorModel:
                  type: object
                  required:
                  - error
                  - message
                  properties:
                    error:
                      type: string
                    message:
                      type: string
            
                FirstNameModel:
                  type: object
                  required:
                  - first_name
                  properties:
                    first_name:
                      type: string
            
                LastNameModel:
                  type: object
                  required:
                  - last_name
                  properties:
                    last_name:
                      type: string
            
                FirstAndLastNameModel:
                  type: object
                  required:
                  - first_name
                  - last_name
                  properties:
                    first_name:
                      type: string
                    last_name:
                      type: string
            
              responses:
                200GetFirstName:
                  description: "Successful response"
                  content:
                    application/json:
                      schema:
                        type: object
                        required:
                        - first_name
                        - full_name
                        properties:
                          first_name:
                            type: string
                          full_name:
                            type: string
            
                200PostFirstName:
                  description: "Successful response"
                  content:
                    application/json:
                      schema:
                        type: object
                        required:
                        - first_name
                        - message
                        properties:
                          first_name:
                            type: string
                          message:
                            type: string
            
                200GetFirstAndLastName:
                  description: "Successful response"
                  content:
                    application/json:
                      schema:
                        type: object
                        required:
                        - first_name
                        - last_name
                        - full_name
                        properties:
                          first_name:
                            type: string
                          last_name:
                            type: string
                          full_name:
                            type: string
            
                200PostFirstAndLastName:
                  description: "Successful response"
                  content:
                    application/json:
                      schema:
                        type: object
                        required:
                        - message
                        properties:
                          first_name:
                            type: string
                          last_name:
                            type: string
                          message:
                            type: string
            
                400PostInvalidBody:
                  description: "Invalid body in POST"
                  content:
                    application/json:
                      schema:
                        $ref: "#/components/schemas/ErrorModel"
            
                409PostAlreadyExists:
                  description: "Duplicate record"
                  content:
                    application/json:
                      schema:
                        $ref: "#/components/schemas/ErrorModel"
        EOT -> (known after apply)
        id                           = "dgo3yzs9ed"
        name                         = "aws-prod-monsternames-api-backend"
        tags                         = {}
#        (9 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.api_gateway.module.restapi_gateway.aws_api_gateway_stage.stages["backend"] will be updated in-place
!~  resource "aws_api_gateway_stage" "stages" {
!~      deployment_id         = "******" -> (known after apply)
        id                    = "ags-dgo3yzs9ed-prod"
        tags                  = {}
#        (9 unchanged attributes hidden)
    }

  # module.api_gateway.module.restapi_gateway.aws_lambda_permission.allow_execution["backend/aws-prod-monsternames-api-backend-lambda/deployment"] must be replaced
-/+ resource "aws_lambda_permission" "allow_execution" {
!~      id                  = "*********************************************" -> (known after apply)
!~      source_arn          = "arn:aws:execute-api:eu-west-2:741139166799:dgo3yzs9ed/*" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # module.lambda.module.lambda.module.lambdas["backend"].module.lambda.aws_lambda_function.this[0] will be updated in-place
!~  resource "aws_lambda_function" "this" {
        id                             = "aws-prod-monsternames-api-backend-lambda"
!~      last_modified                  = "2024-12-04T15:00:48.000+0000" -> (known after apply)
!~      source_code_hash               = "Ac9DUwX0VegqqI4DuCjSm4+e+yHCsipKCtzlOPgeCYM=" -> "EBHsuI7Geey1VuQS4jEt+boUy1A676/vcUJXdv8844M="
        tags                           = {
            "Name" = "aws-prod-monsternames-api-backend-lambda"
        }
#        (22 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.iam_roles.module.iam_roles.aws_iam_role.roles["api-gateway"],
  on /tmp/terraform-data-dir/modules/iam_roles.iam_roles/iam_role.tf line 7, in resource "aws_iam_role" "roles":
   7:   managed_policy_arns = [aws_iam_policy.policy[each.value["suffix"]].arn]

The managed_policy_arns argument is deprecated. Use the
aws_iam_role_policy_attachment resource instead. If Terraform should
exclusively manage all managed policy attachments (the current behavior of
this argument), use the aws_iam_role_policy_attachments_exclusive resource as
well.
```
</details>

:memo: Plan generated in [Terraform checks on pull request #30](https://github.com/sudoblark/sudoblark.monsternames.api/actions/runs/12162595921)